microchip-pic-avr-examples/dspic33ck-mchv3-sensorless-singlephase-bldc-drive/spbldc_fan/spbldc_fan.X/mcc_generated_files/adc1.h
    return status;
}

/**
  @Summary
    Enables interrupts.

  @Description
    This routine is used to enable the ADC1 interrupt.
 
  @Preconditions
    None.

  @Param
    None.

  @Returns
    None.

  @Example
    <code>
        ADC1_InterruptEnable(); 
    </code>
*/
inline static void ADC1_InterruptEnable(void)
{
    IEC5bits.ADCIE = 1;
}

/**
  @Summary
    Disables interrupts.

  @Description
    This routine is used to disable the ADC1 interrupt.
 
  @Preconditions
    None.

  @Param
    None.

  @Returns
    None.

  @Example
    <code>
        ADC1_InterruptDisable(); 
    </code>
*/
inline static void ADC1_InterruptDisable(void)
{
    IEC5bits.ADCIE = 0;
}

/**
  @Summary
    Clears interrupt flag

  @Description
    This routine is used to clear the interrupt flag manually.
 
  @Preconditions
    None.

  @Param
    None.

  @Returns
    None.

  @Example
    <code>
        ADC1_InterruptFlagClear(); 
    </code>
*/
inline static void ADC1_InterruptFlagClear(void)
{
    IFS5bits.ADCIF = 0;
}

/**
  @Summary
    Allows selection of priority for interrupt.

  @Description
    This routine is used to select desired priority for interrupt.
  
  @Preconditions
    None.

  @Param
    None.

  @Returns
    None.

  @Example
    <code>
        uint16_t priorityValue;
        priorityValue = 0x002;
 
        ADC1_InterruptPrioritySet(priorityValue); 
    </code>
*/
inline static void ADC1_InterruptPrioritySet( uint16_t priorityValue )
{
    IPC22bits.ADCIP = 0x7 & priorityValue;
}

/**
  @Summary
    ADC1 Common callback routine.

  @Description
    This routine is a ADC1 Common callback function.
  
  @Preconditions
    None.

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_SetCommonInterruptHandler(&ADC1_CallBack);
    </code>
*/
void ADC1_CallBack(void);

/**
  @Summary
    Assigns a function pointer with a ADC1 Common callback address.

  @Description
    This routine assigns a function pointer with a ADC1 Common callback address.
  
  @Preconditions
    None.

  @Param
    Address of the callback routine.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_SetCommonInterruptHandler(&ADC1_CallBack);
    </code>
*/
void ADC1_SetCommonInterruptHandler(void* handler);


/**
  @Summary
    Enables individual channel interrupt.

  @Description
    This routine is used to enable the ADC1 individual channel
    interrupt.
 
  @Preconditions
    None.

  @Param
    channel - Selected channel

  @Returns
    None.

  @Example
    <code>
        ADC1_IndividualChannelInterruptEnable(channel); 
    </code>
*/
inline static void ADC1_IndividualChannelInterruptEnable(ADC1_CHANNEL channel)
{
    switch(channel)
    {
        case POT1:
                IEC6bits.ADCAN19IE = 1;
                break;
        case channel_AN20:
                IEC6bits.ADCAN20IE = 1;
                break;
        case channel_AN21:
                IEC7bits.ADCAN21IE = 1;
                break;
        case channel_AN24:
                IEC12bits.ADCAN24IE = 1;
                break;
        case channel_AN25:
                IEC12bits.ADCAN25IE = 1;
                break;
        default:
                break;
    }
}

/**
  @Summary
    Disables individual channel interrupt.

  @Description
    This routine is used to disable the ADC1 individual channel
    interrupt.
 
  @Preconditions
    None.

  @Param
    channel - Selected channel

  @Returns
    None.

  @Example
    <code>
        ADC1_IndividualChannelInterruptDisable(channel); 
    </code>
*/
inline static void ADC1_IndividualChannelInterruptDisable(ADC1_CHANNEL channel)
{
    switch(channel)
    {
        case POT1:
                IEC6bits.ADCAN19IE = 0;
                break;
        case channel_AN20:
                IEC6bits.ADCAN20IE = 0;
                break;
        case channel_AN21:
                IEC7bits.ADCAN21IE = 0;
                break;
        case channel_AN24:
                IEC12bits.ADCAN24IE = 0;
                break;
        case channel_AN25:
                IEC12bits.ADCAN25IE = 0;
                break;
        default:
                break;
    }
}

/**
  @Summary
    Clears individual channel interrupt flag

  @Description
    This routine is used to clear the individual channel interrupt flag manually.
 
  @Preconditions
    None.

  @Param
    channel - Selected channel

  @Returns
    None.

  @Example
    <code>
        ADC1_IndividualChannelInterruptFlagClear(channel); 
    </code>
*/
inline static void ADC1_IndividualChannelInterruptFlagClear(ADC1_CHANNEL channel)
{
    switch(channel)
    {
        case POT1:
                IFS6bits.ADCAN19IF = 0;
                break;
        case channel_AN20:
                IFS6bits.ADCAN20IF = 0;
                break;
        case channel_AN21:
                IFS7bits.ADCAN21IF = 0;
                break;
        case channel_AN24:
                IFS12bits.ADCAN24IF = 0;
                break;
        case channel_AN25:
                IFS12bits.ADCAN25IF = 0;
                break;
        default:
                break;
    }
}

/**
  @Summary
    ADC1 POT1 callback routine.

  @Description
    This routine is a ADC1 POT1 callback function.
  
  @Preconditions
    None.

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_SetPOT1InterruptHandler(&ADC1_POT1_CallBack);
    </code>
*/
void ADC1_POT1_CallBack(uint16_t adcVal);

/**
  @Summary
    Assigns a function pointer with a ADC1 POT1 callback address.

  @Description
    This routine assigns a function pointer with a ADC1 POT1 callback address.
  
  @Preconditions
    None.

  @Param
    Address of the callback routine.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_SetPOT1InterruptHandler(&ADC1_POT1_CallBack);
    </code>
*/
void ADC1_SetPOT1InterruptHandler(void* handler);

/**
  @Summary
    ADC1 channel_AN20 callback routine.

  @Description
    This routine is a ADC1 channel_AN20 callback function.
  
  @Preconditions
    None.

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_Setchannel_AN20InterruptHandler(&ADC1_channel_AN20_CallBack);
    </code>
*/
void ADC1_channel_AN20_CallBack(uint16_t adcVal);

/**
  @Summary
    Assigns a function pointer with a ADC1 channel_AN20 callback address.

  @Description
    This routine assigns a function pointer with a ADC1 channel_AN20 callback address.
  
  @Preconditions
    None.

  @Param
    Address of the callback routine.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_Setchannel_AN20InterruptHandler(&ADC1_channel_AN20_CallBack);
    </code>
*/
void ADC1_Setchannel_AN20InterruptHandler(void* handler);

/**
  @Summary
    Polled implementation

  @Description
    This routine is used to implement the tasks for ADC1 channel_AN20 polled implementations.
  
  @Preconditions
    ADC1_Initialize() function should have been 
    called before calling this function.
 
  @Param
    None

  @Returns 
    None
 
  @Example
    <code>    
        ADC1_channel_AN20_Tasks();
    </code>
*/
void ADC1_channel_AN20_Tasks(void);

/**
  @Summary
    ADC1 channel_AN21 callback routine.

  @Description
    This routine is a ADC1 channel_AN21 callback function.
  
  @Preconditions
    None.

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_Setchannel_AN21InterruptHandler(&ADC1_channel_AN21_CallBack);
    </code>
*/
void ADC1_channel_AN21_CallBack(uint16_t adcVal);

/**
  @Summary
    Assigns a function pointer with a ADC1 channel_AN21 callback address.

  @Description
    This routine assigns a function pointer with a ADC1 channel_AN21 callback address.
  
  @Preconditions
    None.

  @Param
    Address of the callback routine.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_Setchannel_AN21InterruptHandler(&ADC1_channel_AN21_CallBack);
    </code>
*/
void ADC1_Setchannel_AN21InterruptHandler(void* handler);

/**
  @Summary
    Polled implementation

  @Description
    This routine is used to implement the tasks for ADC1 channel_AN21 polled implementations.
  
  @Preconditions
    ADC1_Initialize() function should have been 
    called before calling this function.
 
  @Param
    None

  @Returns 
    None
 
  @Example
    <code>    
        ADC1_channel_AN21_Tasks();
    </code>
*/
void ADC1_channel_AN21_Tasks(void);

/**
  @Summary
    ADC1 channel_AN24 callback routine.

  @Description
    This routine is a ADC1 channel_AN24 callback function.
  
  @Preconditions
    None.

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_Setchannel_AN24InterruptHandler(&ADC1_channel_AN24_CallBack);
    </code>
*/
void ADC1_channel_AN24_CallBack(uint16_t adcVal);

/**
  @Summary
    Assigns a function pointer with a ADC1 channel_AN24 callback address.

  @Description
    This routine assigns a function pointer with a ADC1 channel_AN24 callback address.
  
  @Preconditions
    None.

  @Param
    Address of the callback routine.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_Setchannel_AN24InterruptHandler(&ADC1_channel_AN24_CallBack);
    </code>
*/
void ADC1_Setchannel_AN24InterruptHandler(void* handler);

/**
  @Summary
    ADC1 channel_AN25 callback routine.

  @Description
    This routine is a ADC1 channel_AN25 callback function.
  
  @Preconditions
    None.

  @Param
    None.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_Setchannel_AN25InterruptHandler(&ADC1_channel_AN25_CallBack);
    </code>
*/
void ADC1_channel_AN25_CallBack(uint16_t adcVal);

/**
  @Summary
    Assigns a function pointer with a ADC1 channel_AN25 callback address.

  @Description
    This routine assigns a function pointer with a ADC1 channel_AN25 callback address.
  
  @Preconditions
    None.

  @Param
    Address of the callback routine.

  @Returns
    None
 
  @Example 
    <code>
        ADC1_Setchannel_AN25InterruptHandler(&ADC1_channel_AN25_CallBack);
    </code>
*/
void ADC1_Setchannel_AN25InterruptHandler(void* handler);




/**
  Section: Interface Routines: Dedicated Core
*/
/**
  @Summary
    Enables power for Core 0 

  @Description
    This routine is used to set the analog and digital power for ADC1 Core 0.
 
  @Preconditions
    None.

  @Param
    None

  @Returns
    None.

  @Example
    Refer to ADC1_Initialize() for an example
*/
void ADC1_Core0PowerEnable(void);

/**
  @Summary
    Enables power for Core 1 

  @Description
    This routine is used to set the analog and digital power for ADC1 Core 1.
 
  @Preconditions
    None.

  @Param
    None

  @Returns
    None.

  @Example
    Refer to ADC1_Initialize() for an example
*/
void ADC1_Core1PowerEnable(void);


/**
  @Summary
    Enables power for ADC1 shared Core

  @Description
    This routine is used to set the analog and digital power for ADC1 shared Core.
 
  @Preconditions
    None.

  @Param
    None

  @Returns
    None.

  @Example
    Refer to ADC1_Initialize() for an example
*/
void ADC1_SharedCorePowerEnable(void);



